CSI API ETABS v1

# cSapModelEditArea Property

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    cEditArea EditArea { get; }

    ReadOnly Property EditArea As cEditArea
    	Get

    Dim instance As cSapModel
    Dim value As cEditArea

    value = instance.EditArea

    property cEditArea^ EditArea {
    	cEditArea^ get ();
    }

    abstract EditArea : cEditArea with get

#### Property Value

Type: cEditArea

See Also

#### Reference

cSapModel Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com